{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Conv2D","config":{"filters":3,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true,"batch_input_shape":[null,128,128,3],"dtype":"float32"}},{"class_name":"MaxPooling2D","config":{"pool_size":[1,1],"padding":"valid","strides":[1,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true}},{"class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"up_sampling2d_UpSampling2D1","trainable":true}},{"class_name":"Conv2D","config":{"filters":3,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true,"batch_input_shape":[null,256,256,3],"dtype":"float32"}},{"class_name":"MaxPooling2D","config":{"pool_size":[1,1],"padding":"valid","strides":[1,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true}},{"class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"up_sampling2d_UpSampling2D2","trainable":true}},{"class_name":"Conv2D","config":{"filters":3,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true,"batch_input_shape":[null,512,512,3],"dtype":"float32"}},{"class_name":"MaxPooling2D","config":{"pool_size":[1,1],"padding":"valid","strides":[1,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D3","trainable":true}},{"class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"up_sampling2d_UpSampling2D3","trainable":true}},{"class_name":"Conv2D","config":{"filters":3,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true,"batch_input_shape":[null,1024,1024,3],"dtype":"float32"}},{"class_name":"MaxPooling2D","config":{"pool_size":[1,1],"padding":"valid","strides":[1,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D4","trainable":true}},{"class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"up_sampling2d_UpSampling2D4","trainable":true}}]},"keras_version":"tfjs-layers 3.18.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[1,1,3,3],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[3],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[1,1,3,3],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[3],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[1,1,3,3],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[3],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[1,1,3,3],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[3],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.18.0","convertedBy":null}