{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true,"batch_input_shape":[null,16,16,4],"dtype":"float32"}},{"class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"up_sampling2d_UpSampling2D1","trainable":true}},{"class_name":"Conv2D","config":{"filters":4,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true,"batch_input_shape":[null,32,32,256],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true,"batch_input_shape":[null,32,32,4],"dtype":"float32"}}]},"keras_version":"tfjs-layers 3.19.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[1,1,4,256],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[1,1,256,4],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[4],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.19.0","convertedBy":null}